wiyooo/ESP32S3_Camera_USB_uvc/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF)  Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

# Keep esp32-camera SCCB on the legacy I2C driver. The board support code uses
# driver/i2c.h and shares I2C0 with the camera, so linking driver_ng would cause
# ESP-IDF 5.4 to abort before app_main with an I2C driver conflict.
CONFIG_SCCB_HARDWARE_I2C_DRIVER_LEGACY=y
